hint_authentication = {
    'wrong_length_login': 'Длина логина должна быть больше 4 символов!',
    'wrong_login': 'Логин может содержать только цифры, заглавные или строчные латинские буквы и символ'
                   ' подчёркивания "_", но не должен содержать иные символы!',
    'wrong_length_password': 'Длина пароля должна быть больше 8 символов!',
    'wrong_password': 'Пароль может содержать только цифры, заглавные и строчные латинские буквы и символ'
                      ' подчёркивания "_", но не должен содержать иные символы!',
    'wrong_login_or_password': 'Неправильный логин или пароль',
    'wrong_surname': 'Поле "Фамилия" не должно содержать больше одного слова или быть пустым! Составную фамилию следует'
                     ' писать через дефис "-". Только поле "Отчество" может быть пустым',
    'wrong_name': 'Поле "имя" не должно содержать больше одного слова или быть пустым! Составное имя следует'
                  ' писать через дефис "-". Только поле "Отчество" может быть пустым',
    'wrong_patronymic': 'Составное отчество следует писать через дефис "-"!',
    'oops': 'Что-то пошло не так'
}

main_menu = {
    'help': 'Справка',
    'about_program': 'О программе...',
    'about_program_action_text': 'Выпускная квалификационная работа.\n'
                                 'Учебное заведение: Воронежский Институт Высоких Технологий\n'
                                 'Информационная система для автоматизации тестирования персонала "Простые тесты".\n'
                                 '\n'
                                 'Разработчик: Сосин Никита Алексеевич.\n'
                                 'Группа ИС-192'
}

testing = {
    'close_testing': 'Все незавершённые задания будут засчитаны как проваленные!\n'
                     'Вы действительно хотите завершить тест?',
    'close_testing_warning': 'Предупреждение',
    'close_testing_button_yes': 'Завершить',
    'close_testing_button_no': 'Нет'

}

testing_quest = {
    'title': 'Ответ не выбран',
    'text': 'Вы не выбрали или не написали ответ!\n'
            'Прежде чем подтверждать задание, выберите ответ'
}
